Revit 2018 API
Application Methods
The Application type exposes the following members.
Methods
Name | Description
CopyModel
 Copies an existing model to a new file. Overwriting a file of the same name is allowed.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
ExtractPartAtomFromFamilyFile
 Writes a PartAtom XML from the contents of a family file.
GetFailureDefinitionRegistry
 Returns the instance of FailureDefinitionRegistry.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLibraryPaths
 Returns path information identifying where Revit searches for content.
GetRevitServerNetworkHosts
 Gets the list of all Revit Server Network hosts in current session.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetWorksharingCentralGUID
 Gets the worksharing central GUID of the given server-based model.
IsValidThickness
 Checks if the input value is valid to be supplied as a thickness (for an extrusion, or blend, or wall layer, or similar geometric construct).
NewFamilyDocument
 New family document, including family, titleblock, and annotation symbol
NewProjectDocument(String)
 New project document
NewProjectDocument(UnitSystem)
 Creates a new project document with no template file specified.
NewProjectTemplateDocument
 New project template document
OpenBuildingComponentDocument
 Opens a Building Component document from disk.
OpenDocumentFile(String)
 Opens a document from disk.
OpenDocumentFile(ModelPath, OpenOptions)
 Opens a document from disk.
OpenIFCDocument(String)
 Opens an IFC document from disk using default options.
OpenIFCDocument(String, IFCImportOptions)
 Opens an IFC document from disk using custom options.
OpenSharedParameterFile
Enables access to shared parameter groups and definitions that are maintained on disk.
PurgeReleasedAPIObjects
 Explicitly purges all API objects that have been released but are still awaiting to be finalized
RegisterFailuresProcessor
 Registers Revit application-wide instance of Failures Processor.
SetLibraryPaths
 Sets path information identifying where Revit searches for content.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UpdateRenderAppearanceLibrary
 Updates the stored render appearance library, giving the Revit session access to any new RPC content.
WriteJournalComment
 Writes a comment to the Revit journal file.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace